import networkx as nx
import matplotlib.pyplot as plt

# Створюємо порожній граф
metro_graph = nx.Graph()

# Додаємо станції метро як вузли графа
stations = [
    "Шулявська", "Політехнічний інститут",
    "Вокзальна", "Університет", "Театральна / Золоті ворота", "Хрещатик / Майдан незалежності",
    "Арсенальна", "Дніпро", "Гідропарк", "Дорогожичі",
    "Лук'янівська", "Палац спорту / Площа українських героїв", "Кловська", 
    "Печерська", "Звіринецька", "Видубичі", "Контрактова Площа", "Поштова Площа", "Олімпійська", "Палац Україна"
]

metro_graph.add_nodes_from(stations)

# Додаємо зв'язки між станціями
edges = [
    ("Шулявська", "Політехнічний інститут"), ("Політехнічний інститут", "Вокзальна"), 
    ("Вокзальна", "Університет"), ("Університет", "Театральна / Золоті ворота"), 
    ("Театральна / Золоті ворота", "Хрещатик / Майдан незалежності"), ("Хрещатик / Майдан незалежності", "Арсенальна"), 
    ("Арсенальна", "Дніпро"), ("Дніпро", "Гідропарк"), 
    ("Дорогожичі", "Лук'янівська"), ("Лук'янівська", "Театральна / Золоті ворота"), 
    ("Театральна / Золоті ворота", "Палац спорту / Площа українських героїв"), 
    ("Палац спорту / Площа українських героїв", "Кловська"), 
    ("Кловська", "Печерська"), ("Печерська", "Звіринецька"), 
    ("Звіринецька", "Видубичі"), ("Контрактова Площа", "Поштова Площа"),
    ("Поштова Площа", "Хрещатик / Майдан незалежності"), ("Хрещатик / Майдан незалежності", "Палац спорту / Площа українських героїв"),
    ("Палац спорту / Площа українських героїв", "Олімпійська"), ("Олімпійська", "Палац Україна")
]

metro_graph.add_edges_from(edges)

# Рисуємо граф
plt.figure(figsize=(20, 20))
pos = nx.spring_layout(metro_graph, seed=30)
nx.draw(metro_graph, pos, with_labels=True, node_size=2000, node_color="lightblue", font_size=10, font_weight="bold", arrowsize=20)
plt.title("Мережа центральних станцій метро міста Києва")
plt.show()

# Аналізуємо основні характеристики графа
print("Кількість вершин (станцій):", metro_graph.number_of_nodes())
print("Кількість ребер (зв'язків):", metro_graph.number_of_edges())

# Знаходимо ступінь кожної вершини
degrees = dict(metro_graph.degree())
print("Ступінь вершин:")
for station, degree in degrees.items():
    print(f"{station}: {degree}")